"""
2. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b ,
проходящей через эти точки.
"""

print("Введите координаты двух точек прямой")
x1, y1 = [float(itr) for itr in input("Введите координаты первой точки в формате x y: ").split(" ")]
x2, y2 = [float(itr) for itr in input("Введите координаты второй точки в формате x y: ").split(" ")]

k = (y2 - y1)/(x2 - x1)
b = y2 - (k * x2)

print(f"y = {k}x + {b}")
print(f"{k * x1 + b} = k*x1 + b")
print(f"{k * x2 + b} = k*x2 + b")
